# Posttest KB 4: Data Preprocessing

#### Import library pandas, numpy dan sklearn

In [43]:
import pandas as pd
import numpy as np
from sklearn.model_selection import train_test_split

#### Membaca file CSV

In [44]:
dataset_split = pd.read_csv('Forbes Top2000 2017.csv')
dataset_split.head()

,Rank,Company,Country,Sales,Profits,Assets,Market Value,Sector,Industry
0,1,ICBC,China,151.4,42.0,3473.2,229.8,Financials,Major Banks
1,2,China Construction Bank,China,134.2,35.0,3016.6,200.5,Financials,Regional Banks
2,3,Berkshire Hathaway,United States,222.9,24.1,620.9,409.9,Financials,Investment Services
3,4,JPMorgan Chase,United States,102.5,24.2,2513.0,306.6,Financials,Major Banks
4,5,Wells Fargo,United States,97.6,21.9,1943.4,274.4,Financials,Major Banks

#### Menampilkan informasi dataset

In [45]:
dataset_split.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2000 entries, 0 to 1999
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Rank          2000 non-null   int64
 1   Company       2000 non-null   object
 2   Country       2000 non-null   object
 3   Sales         2000 non-null   float64
 4   Profits       2000 non-null   float64
 5   Assets        2000 non-null   float64
 6   Market Value  2000 non-null   float64
 7   Sector        1803 non-null   object
 8   Industry      1509 non-null   object
dtypes: float64(4), int64(1), object(4)
memory usage: 140.8+ KB

#### Panjang record dan atribut

In [46]:
dataset_split.shape

(2000, 9)

# SPLIT DATASET

### 1. Membagi Dataset Menjadi Training Set dan Testing Set dengan Proporsi 70:30

In [47]:
x = dataset_split.iloc[:, :-1]
y = dataset_split.iloc[:, -1]

In [48]:
x_train, x_test, y_train, y_test = train_test_split(x, y, test_size = 0.3)

print('Dimensi x_train : ', x_train.shape)
print('Dimensi x_test  : ', x_test.shape)
print('Dimensi y_train : ', y_train.shape)
print('Dimensi y_test  : ', y_test.shape)

Dimensi x_train :  (1400, 8)
Dimensi x_test  :  (600, 8)
Dimensi y_train :  (1400,)
Dimensi y_test  :  (600,)

# DATA TRANSFORMING

### 2. Normalization

##### Normalisasi pada salah satu atribut (copy dataset terlebih dahulu). Untuk Transformasi Data Normalisasi perlu menggunakan kelas MinMaxScaler pada Scikit-Learn.

In [49]:
from sklearn.preprocessing import MinMaxScaler

In [50]:
datasetCopyNorm = df.copy()

In [51]:
min_max_scaler = MinMaxScaler()

In [54]:
x_norm = min_max_scaler.fit_transform(
    dataset_split[['Rank', 'Sales', 'Profits','Assets', 'Market Value']]
)

##### Normalisasi berhasil

In [55]:
dataNormalisasi = pd.DataFrame(x_norm)

In [56]:
dataNormalisasi.head()

          0         1         2         3         4
0  0.000000  0.311971  0.945017  1.000000  0.305519
1  0.000500  0.276528  0.824742  0.868536  0.266552
2  0.001001  0.459302  0.637457  0.178769  0.545036
3  0.001501  0.211208  0.639175  0.723540  0.407656
4  0.002001  0.201111  0.599656  0.559542  0.364833

### 3. Standarization

##### Standarisasi pada dataset dengan meng-copy dataset terlebih dahulu.

In [57]:
datasetCopyNorm = dataset_split.copy()

In [58]:
print('Nilai standarisasi sebelum dilakukan scaling: ')
np.std(dataset_split)

Nilai standarisasi sebelum dilakukan scaling:

C:\Users\Asus\AppData\Local\Programs\Python\Python310\lib\site-packages\numpy\core\fromnumeric.py:3613: FutureWarning: The default value of numeric_only in DataFrame.std is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  return std(axis=axis, dtype=dtype, out=out, ddof=ddof, **kwargs)

Rank            577.350197
Sales            29.312785
Profits           2.918012
Assets          260.919234
Market Value     44.750208
dtype: float64

##### Untuk Transformasi Data Standarisasi perlu menggunakan kelas StandardScaler pada Scikit-Learn

In [59]:
from sklearn.preprocessing import StandardScaler

In [60]:
standard_scaler = StandardScaler()

In [62]:
x_standard = standard_scaler.fit_transform(
    dataset_split[['Rank', 'Sales', 'Profits', 'Assets', 'Market Value']]
)

##### Standarisasi berhasil

In [63]:
print('Nilai sesudah dilakukan scalling: ')
np.std(x_standard)

Nilai sesudah dilakukan scalling:

0.9999999999999999

In [64]:
data_standarisasi = pd.DataFrame(x_standard)
data_standarisasi.head()

          0         1          2          3         4
0 -1.731185  4.562360  13.968168  12.987415  4.589524
1 -1.729453  3.975586  11.569275  11.237448  3.934779
2 -1.727721  7.001569   7.833855   2.055680  8.614086
3 -1.725989  2.894146   7.868125   9.307349  6.305717
4 -1.724257  2.726984   7.079917   7.124298  5.586167

In [65]:
np.mean(x_standard)

1.7053025658242403e-17

# DATA CLEANING

### 4. Menangani Nilai NULL pada Dataset

##### Mengecek nilai null pada dataset.

In [66]:
print('Jumlah Record yang punya nilai NULL: ')
dataset_split.isnull().sum()

Jumlah Record yang punya nilai NULL:

Rank              0
Company           0
Country           0
Sales             0
Profits           0
Assets            0
Market Value      0
Sector          197
Industry        491
dtype: int64

In [67]:
print('Jumlah Record yang punya nilai NULL: ')
dataset_split.isna().sum()

Jumlah Record yang punya nilai NULL:

Rank              0
Company           0
Country           0
Sales             0
Profits           0
Assets            0
Market Value      0
Sector          197
Industry        491
dtype: int64

#### Untuk menangani nilai NULL pada dataset kita dapat menggunakan kelas SimpleImputer pada Scikit-Learn.

In [68]:
from sklearn.impute import SimpleImputer

##### Mengubah nilai null type objek dengan Strategi modus.

In [105]:
simpleImputerObjek = SimpleImputer(strategy = 'most_frequent')
dataset_split['Sector'] = simpleImputerObjek.fit_transform(df[['Sector']])
dataset_split['Industry'] = simpleImputerObjek.fit_transform(df[['Industry']])
dataset_split.isnull().sum()

Rank            13
Company          0
Country          0
Sales            0
Profits          0
Assets           0
Market Value     0
Sector           0
Industry         0
dtype: int64

* Karena Data tidak ada yang bernilai null untuk bilangan bulat dan bilangan desimal maka kita buat terlebih dahulu.

In [101]:
pd.options.mode.chained_assignment = None

dataset_split.Rank[[5,10,20,100,200,300,400,500,600,700,800,900,1000]]=None;
dataset_split.Sales[[5,10,20,100,200,300,400,500,600,700,800,900,1000]]=None;

dataset_split[dataset_split.isnull().any(axis=1)]

,Rank,Company,Country,Sales,Profits,Assets,Market Value,Sector,Industry
5,NaN,Agricultural Bank of China,China,115.70,27.800,2816.0,149.2,Financials,Regional Banks
10,NaN,AT&T,United States,163.80,13.000,403.8,249.3,Telecommunication Services,Telecommunications services
12,13.0,Exxon Mobil,United States,197.50,7.800,330.3,343.2,Energy,NaN
20,NaN,Allianz,Germany,115.70,7.600,935.9,83.7,Financials,Diversified Insurance
23,24.0,Alphabet,United States,89.90,19.500,167.5,579.5,Information Technology,NaN
...,...,...,...,...,...,...,...,...,...
1988,1989.0,Barry Callebaut,Switzerland,6.80,0.221,5.8,7.3,Consumer Discretionary,NaN
1991,1992.0,Guangxi Guiguan Electric Power,China,2.00,0.643,6.0,6.0,Energy,NaN
1992,1993.0,Live Nation Entertainment,United States,8.40,-0.047,6.8,6.4,Energy,NaN
1996,1997.0,Fastighets Balder,Sweden,0.63,0.639,10.2,3.8,Materials,NaN
1999,2000.0,Tech Mahindra,India,4.20,0.469,3.6,6.7,Information Technology,NaN

* Melakukan pengecekan lagi

In [86]:
dataset_split.isnull().sum()

Rank            13
Company          0
Country          0
Sales           13
Profits          0
Assets           0
Market Value     0
Sector           0
Industry         0
dtype: int64

##### Mengubah nilai null type float dengan Strategi Mean.

In [106]:
simpleImputerfloat = SimpleImputer(strategy = 'mean')
dataset_split['Sales'] = simpleImputerfloat.fit_transform(df[['Sales']])
dataset_split.isnull().sum()

Rank            13
Company          0
Country          0
Sales            0
Profits          0
Assets           0
Market Value     0
Sector           0
Industry         0
dtype: int64

##### Mengubah nilai null type int dengan Strategi Median.

In [96]:
dataset_split = pd.read_csv('Forbes Top2000 2017.csv')

In [107]:
simpleImputerint = SimpleImputer(strategy="median")
dataset_split["Rank"] = simpleImputerint.fit_transform(dataset_split[["Rank"]])
dataset_split.isna().sum()

Rank            0
Company         0
Country         0
Sales           0
Profits         0
Assets          0
Market Value    0
Sector          0
Industry        0
dtype: int64

### 5. Menangani Nilai Duplikat pada Dataset.

* Mengecek Data dan Jumlah Nilai Duplikat pada Dataset

In [110]:
dataset_split[dataset_split.duplicated()]

Empty DataFrame
Columns: [Rank, Company, Country, Sales, Profits, Assets, Market Value, Sector, Industry]
Index: []

In [111]:
dataset_split.duplicated().sum()

0

* Membuat Data Duplikat

In [116]:
duplicate1 = pd.DataFrame([[2, 'ICBC', 'China', 151.4, 42, 3473.2, 229.8, 
                           'Financials', 'Major Banks']],
                        columns =['Rank', 'Company', 'Country', 'Sales', 'Profits', 
                                  'Assets','Market Value', 'Sector', 'Industry'])


duplicate2 = pd.DataFrame([[2, 'ICBC', 'China', 151.4, 42, 3473.2, 229.8, 
                           'Financials', 'Major Banks']],
                        columns =['Rank', 'Company', 'Country', 'Sales', 'Profits', 
                                  'Assets','Market Value', 'Sector', 'Industry'])
             
dataset_split = dataset_split.append([duplicate1, duplicate2], ignore_index=True)

C:\Users\Asus\AppData\Local\Temp\ipykernel_6588\3055183154.py:12: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  dataset_split = dataset_split.append([duplicate1, duplicate2], ignore_index=True)

* Melakukan Pengecekan Data Lagi Setelah Membuat Data Duplikat.

In [117]:
dataset_split.duplicated().sum()

1

In [118]:
dataset_split[dataset_split.duplicated()]

,Rank,Company,Country,Sales,Profits,Assets,Market Value,Sector,Industry
2001,2.0,ICBC,China,151.4,42.0,3473.2,229.8,Financials,Major Banks

##### Menghapus Nilai Duplikat

In [119]:
dataset_split.drop_duplicates(inplace=True)

##### Nilai Duplikat Berhasil Dihapus

In [120]:
dataset_split[dataset_split.duplicated()]

Empty DataFrame
Columns: [Rank, Company, Country, Sales, Profits, Assets, Market Value, Sector, Industry]
Index: []

In [128]:
dataset_split.duplicated().sum()

0

### 6. Mengubah Tipe Data Salah Satu Atribut Bertipe Angka

In [129]:
dataset_split = pd.read_csv('Forbes Top2000 2017.csv')

In [130]:
dataset_split.dtypes

Rank              int64
Company          object
Country          object
Sales           float64
Profits         float64
Assets          float64
Market Value    float64
Sector           object
Industry         object
dtype: object

* Mengubah Tipe data menjadi Object.

In [147]:
dataset_split['Rank'] = dataset_split['Rank'].astype('object')
dataset_split.dtypes

Rank             object
Company          object
Country          object
Sales           float64
Profits         float64
Assets          float64
Market Value    float64
Sector           object
Industry         object
dtype: object

* Mengubah Tipe data menjadi Float.

In [149]:
dataset_split['Rank'] = dataset_split['Rank'].astype('float64')
dataset_split.dtypes

Rank            float64
Company          object
Country          object
Sales           float64
Profits         float64
Assets          float64
Market Value    float64
Sector           object
Industry         object
dtype: object

# ENCODING

### 7. One Hot Encoding.

##### Menerapkan One-Hot Encoding menggunakan OneHotEncoder dari Scikit-Learn.

In [159]:
from sklearn.preprocessing import OneHotEncoder

##### Disini saya menggunakan atribut 'Company'

In [165]:
oneHotEncoder = OneHotEncoder(sparse_output = False)

In [169]:
onehot = oneHotEncoder.fit_transform(df[['Company']])

In [170]:
dataonehot = pd.DataFrame(onehot)

In [172]:
dataset_split = dataset_split.join(dataonehot)
dataset_split.head()

,Rank,Company,Country,Sales,Profits,Assets,Market Value,Sector,Industry,0,...,1989,1990,1991,1992,1993,1994,1995,1996,1997,1998
0,1.0,ICBC,China,151.4,42.0,3473.2,229.8,Financials,Major Banks,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,2.0,China Construction Bank,China,134.2,35.0,3016.6,200.5,Financials,Regional Banks,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,3.0,Berkshire Hathaway,United States,222.9,24.1,620.9,409.9,Financials,Investment Services,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,4.0,JPMorgan Chase,United States,102.5,24.2,2513.0,306.6,Financials,Major Banks,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,5.0,Wells Fargo,United States,97.6,21.9,1943.4,274.4,Financials,Major Banks,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

##### Menerapkan One-Hot Encoding menggunakan get_dummies dari Pandas

##### Disini saya menggunakan atribut 'Industry'

In [174]:
Dummies = pd.get_dummies(dataset_split[['Industry']])

In [175]:
Industry = pd.DataFrame(Dummies)
dataset_split = dataset_split.join(Industry)

In [176]:
dataset_split.head(10)

,Rank,Company,Country,Sales,Profits,Assets,Market Value,Sector,Industry,0,...,Industry_Security Systems,Industry_Semiconductors,Industry_Software & Programming,Industry_Specialized Chemicals,Industry_Specialty Stores,Industry_Telecommunications services,Industry_Thrifts & Mortgage Finance,Industry_Tobacco,Industry_Trading Companies,Industry_Trucking
0,1.0,ICBC,China,151.4,42.0,3473.2,229.8,Financials,Major Banks,0.0,...,0,0,0,0,0,0,0,0,0,0
1,2.0,China Construction Bank,China,134.2,35.0,3016.6,200.5,Financials,Regional Banks,0.0,...,0,0,0,0,0,0,0,0,0,0
2,3.0,Berkshire Hathaway,United States,222.9,24.1,620.9,409.9,Financials,Investment Services,0.0,...,0,0,0,0,0,0,0,0,0,0
3,4.0,JPMorgan Chase,United States,102.5,24.2,2513.0,306.6,Financials,Major Banks,0.0,...,0,0,0,0,0,0,0,0,0,0
4,5.0,Wells Fargo,United States,97.6,21.9,1943.4,274.4,Financials,Major Banks,0.0,...,0,0,0,0,0,0,0,0,0,0
5,6.0,Agricultural Bank of China,China,115.7,27.8,2816.0,149.2,Financials,Regional Banks,0.0,...,0,0,0,0,0,0,0,0,0,0
6,7.0,Bank of America,United States,92.2,16.6,2196.8,231.9,Financials,Major Banks,0.0,...,0,0,0,0,0,0,0,0,0,0
7,8.0,Bank of China,China,113.1,24.9,2611.5,141.3,Financials,Major Banks,0.0,...,0,0,0,0,0,0,0,0,0,0
8,9.0,Apple,United States,217.5,45.2,331.1,752.0,Information Technology,Computer Hardware,0.0,...,0,0,0,0,0,0,0,0,0,0
9,10.0,Toyota Motor,Japan,249.9,17.1,412.5,171.9,Consumer Discretionary,Auto & Truck Manufacturers,0.0,...,0,0,0,0,0,0,0,0,0,0